import { Component, OnInit } from '@angular/core';
import * as Highcharts from 'highcharts';
import { NavController } from '@ionic/angular';

@Component({
  selector: 'app-record-his-pro',
  templateUrl: './record-his-pro.page.html',
  styleUrls: ['./record-his-pro.page.scss'],
})
export class RecordHisProPage {
  chart1: Highcharts.Chart;
  constructor(private nav: NavController) { }

  goBack(){
    this.nav.back();
  }

  ionViewDidEnter() {
    this.chart1 = Highcharts.chart('container1', {
      title: {
        text: '',
        x: -20
      },
      subtitle: {
        text: '',
        x: -20
      },
      xAxis: {
        type: 'datetime',
        labels: {
          formatter: function() {
            let s = Highcharts.dateFormat('%Y-%m-%d %H:%M:%S', this.value);
            return s;
          }
        }
      },
      yAxis: {
        title: {
        text: ''
      },
      plotLines: [{
        value: 0,
        width: 1,
        color: '#808080'
      }]
      },
      tooltip: {
        xDateFormat: '%Y-%m-%d %H:%M:%S',
        valueSuffix: '' //单位
      },
      legend: {
        layout: 'vertical',
        align: 'right',
        verticalAlign: 'middle',
        borderWidth: 0
      },
      series: [{
        type: 'column',
        name: '',
        zones: [{
          value: 0.76,
          color: '#4CDB3F'
        },{
          color: '#FB4566'
        }],
        data: [
          [
            1167609600000,
            0.7537
          ],
          [
            1167696000000,
            0.7537
          ],
          [
            1167782400000,
            0.7559
          ],
          [
            1167868800000,
            0.7631
          ],
          [
            1167955200000,
            0.7644
          ],
          [
            1168214400000,
            0.769
          ],
          [
            1168300800000,
            0.7683
          ],
          [
            1168387200000,
            0.77
          ],
          [
            1168473600000,
            0.7703
          ],
          [
            1168560000000,
            0.7757
          ],
          [
            1168819200000,
            0.7728
          ],
          [
            1168905600000,
            0.7721
          ],
          [
            1168992000000,
            0.7748
          ],
          [
            1169078400000,
            0.774
          ],
          [
            1169164800000,
            0.7718
          ],
          [
            1169424000000,
            0.7731
          ],
          [
            1169510400000,
            0.767
          ],
          [
            1169596800000,
            0.769
          ],
          [
            1169683200000,
            0.7706
          ],
          [
            1169769600000,
            0.7752
          ],
          [
            1170028800000,
            0.774
          ],
          [
            1170115200000,
            0.771
          ],
          [
            1170201600000,
            0.7721
          ],
          [
            1170288000000,
            0.7681
          ],
          [
            1170374400000,
            0.7681
          ],
          [
            1170633600000,
            0.7738
          ],
          [
            1170720000000,
            0.772
          ],
          [
            1170806400000,
            0.7701
          ],
          [
            1170892800000,
            0.7699
          ],
          [
            1170979200000,
            0.7689
          ],
          [
            1171238400000,
            0.7719
          ],
          [
            1171324800000,
            0.768
          ],
          [
            1171411200000,
            0.7645
          ],
          [
            1171497600000,
            0.7613
          ],
          [
            1171584000000,
            0.7624
          ],
          [
            1171843200000,
            0.7616
          ],
          [
            1171929600000,
            0.7608
          ],
          [
            1172016000000,
            0.7608
          ],
          [
            1172102400000,
            0.7631
          ],
          [
            1172188800000,
            0.7615
          ],
          [
            1172448000000,
            0.76
          ],
          [
            1172534400000,
            0.756
          ],
          [
            1172620800000,
            0.757
          ],
          [
            1172707200000,
            0.7562
          ],
          [
            1172793600000,
            0.7598
          ],
          [
            1173052800000,
            0.7645
          ],
          [
            1173139200000,
            0.7635
          ],
          [
            1173225600000,
            0.7614
          ],
          [
            1173312000000,
            0.7604
          ],
          [
            1173398400000,
            0.7603
          ],
          [
            1173657600000,
            0.7602
          ],
          [
            1173744000000,
            0.7566
          ],
          [
            1173830400000,
            0.7587
          ],
          [
            1173916800000,
            0.7562
          ],
          [
            1174003200000,
            0.7506
          ],
          [
            1174262400000,
            0.7518
          ],
          [
            1174348800000,
            0.7522
          ],
          [
            1174435200000,
            0.7524
          ]],
        showInLegend: false // 设置为 false 即为不显示在图例中
      }],
      credits:{
        enabled: false // 禁用版权信息
      }
    });
  }

}
